scr1c/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

scr1c/Catalogs/ДоговорыКонтрагентов/Forms/ФормаПодбораДоговора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонтрагентВладелец = Параметры.Владелец;
	Стк = Новый Структура("идКА",Параметры.Владелец.УникальныйИдентификатор());
	
	тбл = глОбщий.ДанныеАПИ("DOGPURS",Стк);
	
	тблДоговора.Загрузить(тбл);
	

КонецПроцедуры

&НаСервере
Функция тблДоговораВыборНаСервере(Стк)  
	
	сс = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Стк.ид);
	Если СтрНайти(сс,"не найден")<>0 Тогда
		Обк = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		обк.УстановитьСсылкуНового(сс);   
		обк.Владелец = КонтрагентВладелец;
	ИНаче
		обк = сс.ПолучитьОбъект();
	КонецеслИ;  
	
	Если обк.Владелец <> КонтрагентВладелец Тогда
		Сообщить("ОШибка владельца договора! Владелец "+Обк.владелец);
		Возврат Неопределено;
	КонецеслИ;
	
	ЗаполнитьЗначенияСвойств(Обк,Стк);
	Обк.Записать();
	
	Возврат Обк.ссылКа;
	
КонецФункции

&НаКлиенте
Процедура тблДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	Стк = Новый Структура("Код,Наименование,Дата,Номер,СрокДействия,ид"); 
	ЗаполнитьЗначенияСвойств(Стк,Элементы.тблДоговора.ТекущиеДанные);
	
	ссДог = тблДоговораВыборНаСервере(Стк);  
	Если ссДог = Неопределено Тогда Возврат; КонецеслИ;
	ОповеститьОбИзменении(ссДог);
	
	этаФОрма.Закрыть();
КонецПроцедуры
